## K-Means clustering

In [33]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [34]:
from sklearn.cluster import KMeans
from sklearn.preprocessing import StandardScaler

# Select features and copy to avoid warnings
X = df[['age', 'fare']].copy()

# Fix missing values
X['age'] = X['age'].fillna(X['age'].mean())

# Scale features
scaler = StandardScaler()
X_scaled = scaler.fit_transform(X)

# Clustering
model = KMeans(n_clusters=5, random_state=42)
model.fit(X_scaled)

# Assign cluster labels back to df
df['cluster'] = model.labels_

In [35]:
# saving the model
import joblib
joblib.dump(model, 'KMeansClustering.joblib')

['KMeansClustering.joblib']

In [36]:
# load the saved model
model_loaded = joblib.load('KMeansClustering.joblib')

In [37]:
# lets do Decision Tree Classifier on new dataset

import seaborn as sns
df_1 = sns.load_dataset('tips')
df_1

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [38]:
# lets apply Decision Tree classifier
X = df_1.drop(columns= ['sex'])
y = df_1['sex']

In [39]:
# lets check the head
X.head()

   total_bill   tip smoker  day    time  size
0       16.99  1.01     No  Sun  Dinner     2
1       10.34  1.66     No  Sun  Dinner     3
2       21.01  3.50     No  Sun  Dinner     3
3       23.68  3.31     No  Sun  Dinner     2
4       24.59  3.61     No  Sun  Dinner     4

In [40]:
y.head()

0    Female
1      Male
2      Male
3      Male
4    Female
Name: sex, dtype: category
Categories (2, object): ['Male', 'Female']

In [41]:
# lets check the null values
df_1.isnull().sum()

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

In [42]:
df_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.4 KB

In [43]:
# lets transfer the smoker by LabelEncoder
from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()
le.fit(df_1['smoker'])

df_1['smoker'] = le.transform(df_1['smoker'])

In [44]:
# lets transfer the day by LabelEncoder
from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()
le.fit(df_1['day'])

df_1['day'] = le.transform(df_1['day'])

In [45]:
# lets transfer the time by LabelEncoder
from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()
le.fit(df_1['time'])

df_1['time'] = le.transform(df_1['time'])

In [46]:
# now lets check it
df_1

     total_bill   tip     sex  smoker  day  time  size
0         16.99  1.01  Female       0    2     0     2
1         10.34  1.66    Male       0    2     0     3
2         21.01  3.50    Male       0    2     0     3
3         23.68  3.31    Male       0    2     0     2
4         24.59  3.61  Female       0    2     0     4
..          ...   ...     ...     ...  ...   ...   ...
239       29.03  5.92    Male       0    1     0     3
240       27.18  2.00  Female       1    1     0     2
241       22.67  2.00    Male       1    1     0     2
242       17.82  1.75    Male       0    1     0     2
243       18.78  3.00  Female       0    3     0     2

[244 rows x 7 columns]

In [47]:
X.head()

   total_bill   tip smoker  day    time  size
0       16.99  1.01     No  Sun  Dinner     2
1       10.34  1.66     No  Sun  Dinner     3
2       21.01  3.50     No  Sun  Dinner     3
3       23.68  3.31     No  Sun  Dinner     2
4       24.59  3.61     No  Sun  Dinner     4

In [48]:
y.head()

0    Female
1      Male
2      Male
3      Male
4    Female
Name: sex, dtype: category
Categories (2, object): ['Male', 'Female']

In [49]:
X = pd.get_dummies(X, columns= ['smoker'])

In [51]:
df_1 = pd.get_dummies(df_1, columns=['day'], drop_first=True)

In [53]:
from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()

for col in X.columns:
    if X[col].dtype == 'object' or X[col].dtype.name == 'category':
        X[col] = le.fit_transform(X[col])

In [54]:
from sklearn.tree import DecisionTreeClassifier

model = DecisionTreeClassifier()
model = model.fit(X,y)

In [55]:
joblib.dump(model, "tips_model.joblib")

['tips_model.joblib']

In [57]:
# if i want to load the model
model_1 = joblib.load('tips_model.joblib')

In [ ]:
# lets save the model in pickle
import pickle
# save the model in write binary
with open("model.pkl", 'wb') as f:
    pickle.dump(model, f)

# load the model in read binary
with open('model.pkl','rb')as f:
    loaded_model = pickle.load(f)